{
  "workExperience":
  [
    {
      "id": 1,
      "title": "Software Engineer",
      "company": "Credit Karma",
      "logo": "creditKarma.png",
      "startDate": "December 2017",
      "endDate": "Present",
      "location": "Charlotte, NC",
      "achievements": [
      ]
    },
    {
      "id": 2,
      "title": "Software Engineer & Co-Founder",
      "company": "Youxpert",
      "logo": "youxpertIcon.png",
      "startDate": "Janurary 2016",
      "endDate": "June 2017",
      "location": "Charlotte, NC",
      "achievements": [
        { "id": 1,
          "description": "Architected Ruby on Rails healthcare platform for San Francisco based startup MPI Cognition to demonstrate their patient record file system service to 15+ doctors during user testing sessions."
        },
        { "id": 2,
          "description": "Engineered ecommerce website Relax, Let Us Work using Wix, SEO and Google Analytics allowing users to purchase personal concierge services online, increasing sales by 40%"
        },
        { "id": 3,
          "description": "Conducted user research, cognitive walkthroughs and A/B testing for parental control startup, Zabra , which led to 50% increase in site visitors per week."
        },
        { "id": 4,
          "description": "Developed company corporate site using JavaScript, ES6, and ReactJS, increasing sales by > 60% after launch."
        }
      ]
    },
    {
      "id": 3,
      "title": "Full Stack Software Engineering Intern",
      "company": "Carbon Five",
      "logo": "carbonFive.png",
      "startDate": "May 2016",
      "endDate": "August 2016",
      "location": "San Francisco, CA",
      "achievements": [
        { "id": 1,
          "description": "Met with startup founders daily to discuss features, suggest designs and explain agile development"
        },
        { "id": 2,
          "description": "Gave advice during scrum meetings and strategized methods for solving software issues in a short-cycle, iterative, and agile environment"
        },
        { "id": 3,
          "description": "Developed credit card and personal information authentication system using JavaScript, ReactJS, Redux and Ruby on Rails for Swell Investing’s stock trading platform."
        },
        { "id": 4,
          "description": "Followed TDD in creating socially responsible investment system, achieving 90%+ code coverage writing 60+ unit tests utilizing Jest, Enzyme and RSpec."
        },
        { "id": 5,
          "description": "Developed the user interface and the PDF generator for a React app that gets parents and kids together for an agreement about being responsible with new technology. Increasing visitors by 30%."
        },
        { "id": 6,
          "description": "Re-engineered front end and implemented Instagram feed to internal company dashboard using Sass, Ruby and Sinatra, increasing employee participation in all three offices by over 40%."
        },
        { "id": 7,
          "description": "Added features to an internal company Slack Bot using the Ruby Slack Client library, improving employee timekeeping"
        }
      ]
    },
    {
      "id": 4,
      "title": "Full Stack Software Engineering Intern",
      "company": "Hewlett-Packard",
      "logo": "hp.png",
      "startDate": "May 2015",
      "endDate": "August 2015",
      "location": "Corvallis, OR",
      "achievements": [
        { "id": 1,
          "description": "Built, unit tested and added features to three Ruby on Rails web applications in 11 weeks using HTML5, CSS3, JavaScript, Bootstrap, RSpec, and Git in a Linux environment"
        },
        { "id": 2,
          "description": "Wrote unit tests with RSpec and built the user interface with HTML and Sass for a customer-facing social media web app that received acclaim at demos in New York and Portland and The QVC Shopping Network."
        },
        { "id": 3,
          "description": "Designed automated tests using RSpec that measured the grading accuracy of a test grading app for local Oregon college students. Resulting in 0 bug reports after release."
        },
        { "id": 4,
          "description": "Gave advice during scrum meetings and strategized methods for solving software issues in a short-cycle, iterative, and agile environment"
        },
        { "id": 5,
          "description": "Participated in usability testing events with cognitive walkthroughs"
        }
      ]
    },
    {
      "id": 5,
      "title": "College of Engineering Dean's Office Assistant",
      "company": "The University of North Carolina at Charlotte",
      "logo": "unccIcon.png",
      "startDate": "October 2011",
      "endDate": "May 2014",
      "location": "Charlotte, NC",
      "achievements": [
        { "id": 1,
          "description": "Proofread documents and assembled materials for staff events, conferences and meetings"
        },
        { "id": 2,
          "description": "Created digital copies of budget archives, increasing office storage space by 30%"
        },
        { "id": 3,
          "description": "Assisted event coordinator in planning for an average of 3 office events per semester."
        }
      ]
    }
  ],
  "volunteerExperience":
  [
    {
      "id": 1,
      "title": "Co-Founder & President",
      "company": "Advancing Innovative Minds",
      "logo": "aimIcon.png",
      "startDate": "September 2015",
      "endDate": "December 2015",
      "location": "Charlotte, NC",
      "achievements": [
        {
          "id": 1,
          "description": "Created a student organization to gather the university’s most innovative students and entrepreneurial resources to turn ideas into startup companies"
        },
        {
          "id": 2,
          "description": "Gained fifty new members in four months, and held seminars with small business owners every two weeks."
        },
        {
          "id": 3,
          "description": "Designed the club web application with Rails, HTML, Sass and RSpec with built in online donations and user newsletter sign-up features, increasing membership sign ups by 150% and donations by 100%."
        },
        {
          "id": 4,
          "description": "Selected as a finalist in the North Carolina Social Entrepreneurship Competition."
        },
        {
          "id": 5,
          "description": "Won Best New Organization at UNC Charlotte out of 51 new organizations for demonstrating consistent flexibility, initiative, creativity, and perseverance."
        }
      ]
    },
    {
      "id": 2,
      "title": "Vice President & PCI Commitee Member",
      "company": "National Society of Black Engineers",
      "logo": "nsbeIcon.png",
      "startDate": "October 2011",
      "endDate": "May 2015",
      "location": "Charlotte, NC",
      "achievements": [
        {
          "id": 1,
          "description": "Disseminating information among chapter members and alumni through the NSBE website"
        },
        {
          "id": 2,
          "description": "Volunteer speaker for middle school academic development seminars"
        },
        {
          "id": 3,
          "description": "Participating in Community Service and Mentoring Activities"
        },
        {
          "id": 4,
          "description": "Created the new official website for the NSBE chapter at UNC Charlotte"
        }
      ]
    }
  ]
}
